In [10]:
import dash
import dash_core_components as dcc
import dash_html_components as html
import pandas as pd

In [4]:
data = pd.read_csv('../../datasets/avocado.csv')
data.shape

(18249, 14)

In [7]:
data = data.query("type == 'conventional' and region == 'Albany'")
data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 169 entries, 0 to 8489
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    169 non-null    int64
 1   Date          169 non-null    object
 2   AveragePrice  169 non-null    float64
 3   Total Volume  169 non-null    float64
 4   4046          169 non-null    float64
 5   4225          169 non-null    float64
 6   4770          169 non-null    float64
 7   Total Bags    169 non-null    float64
 8   Small Bags    169 non-null    float64
 9   Large Bags    169 non-null    float64
 10  XLarge Bags   169 non-null    float64
 11  type          169 non-null    object
 12  year          169 non-null    int64
 13  region        169 non-null    object
dtypes: float64(9), int64(2), object(3)
memory usage: 23.9+ KB

In [15]:
data = data.copy()
data['Date'] = pd.to_datetime(data['Date'], format='%Y-%m-%d')
data.sort_values('Date', inplace=True)

In [16]:
data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
51,51,2015-01-04,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
50,50,2015-01-11,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
49,49,2015-01-18,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
48,48,2015-01-25,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
47,47,2015-02-01,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany